{"config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 60, 200, 3], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block1_conv1", "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "block1_conv2", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block1_conv2", "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": false, "dim_ordering": "tf"}, "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"name": "block2_conv1", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block2_conv1", "init": "glorot_uniform", "nb_filter": 128, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"name": "block2_conv2", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block2_conv2", "init": "glorot_uniform", "nb_filter": 128, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": false, "dim_ordering": "tf"}, "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"name": "block3_conv1", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block3_conv1", "init": "glorot_uniform", "nb_filter": 256, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"name": "block3_conv2", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block3_conv2", "init": "glorot_uniform", "nb_filter": 256, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"name": "block3_conv3", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block3_conv3", "init": "glorot_uniform", "nb_filter": 256, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": false, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": false, "dim_ordering": "tf"}, "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"name": "block4_conv1", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block4_conv1", "init": "glorot_uniform", "nb_filter": 512, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"name": "block4_conv2", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block4_conv2", "init": "glorot_uniform", "nb_filter": 512, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"name": "block4_conv3", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block4_conv3", "init": "glorot_uniform", "nb_filter": 512, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"name": "block5_conv1", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block5_conv1", "init": "glorot_uniform", "nb_filter": 512, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"name": "block5_conv2", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block5_conv2", "init": "glorot_uniform", "nb_filter": 512, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"name": "block5_conv3", "class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "name": "block5_conv3", "init": "glorot_uniform", "nb_filter": 512, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "dim_ordering": "tf", "b_regularizer": null}, "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "globalaveragepooling2d_1", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"output_dim": 512, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "bias": true, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"output_dim": 256, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"output_dim": 64, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "bias": true, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.1}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"output_dim": 1, "activation": "linear", "activity_regularizer": null, "init": "zero", "name": "dense_4", "bias": true, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0]]]}], "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.2"}