{"keras_version": "1.1.2", "config": {"layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 140, 200, 3], "input_dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"border_mode": "same", "W_constraint": null, "name": "block1_conv1", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "block1_conv2", "config": {"border_mode": "same", "W_constraint": null, "name": "block1_conv2", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"name": "block1_pool", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "block1_pool", "strides": [2, 2], "trainable": false, "dim_ordering": "tf"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"name": "block2_conv1", "config": {"border_mode": "same", "W_constraint": null, "name": "block2_conv1", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 128, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"name": "block2_conv2", "config": {"border_mode": "same", "W_constraint": null, "name": "block2_conv2", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 128, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"name": "block2_pool", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "block2_pool", "strides": [2, 2], "trainable": false, "dim_ordering": "tf"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"name": "block3_conv1", "config": {"border_mode": "same", "W_constraint": null, "name": "block3_conv1", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 256, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"name": "block3_conv2", "config": {"border_mode": "same", "W_constraint": null, "name": "block3_conv2", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 256, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"name": "block3_conv3", "config": {"border_mode": "same", "W_constraint": null, "name": "block3_conv3", "subsample": [1, 1], "bias": true, "trainable": false, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 256, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"name": "block3_pool", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "block3_pool", "strides": [2, 2], "trainable": false, "dim_ordering": "tf"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"name": "block4_conv1", "config": {"border_mode": "same", "W_constraint": null, "name": "block4_conv1", "subsample": [1, 1], "bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 512, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"name": "block4_conv2", "config": {"border_mode": "same", "W_constraint": null, "name": "block4_conv2", "subsample": [1, 1], "bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 512, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"name": "block4_conv3", "config": {"border_mode": "same", "W_constraint": null, "name": "block4_conv3", "subsample": [1, 1], "bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 512, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"name": "block4_pool", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "block4_pool", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"name": "block5_conv1", "config": {"border_mode": "same", "W_constraint": null, "name": "block5_conv1", "subsample": [1, 1], "bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 512, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"name": "block5_conv2", "config": {"border_mode": "same", "W_constraint": null, "name": "block5_conv2", "subsample": [1, 1], "bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 512, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"name": "block5_conv3", "config": {"border_mode": "same", "W_constraint": null, "name": "block5_conv3", "subsample": [1, 1], "bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 512, "nb_col": 3, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"name": "block5_pool", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "block5_pool", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"name": "globalaveragepooling2d_1", "config": {"dim_ordering": "tf", "name": "globalaveragepooling2d_1", "trainable": true}, "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"name": "dense_1", "config": {"W_constraint": null, "name": "dense_1", "bias": true, "trainable": true, "output_dim": 1024, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_2", "config": {"W_constraint": null, "name": "dense_2", "bias": true, "trainable": true, "output_dim": 512, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}, "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "dense_3", "config": {"W_constraint": null, "name": "dense_3", "bias": true, "trainable": true, "output_dim": 128, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "dense_4", "config": {"W_constraint": null, "name": "dense_4", "bias": true, "trainable": true, "output_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "activation": "elu"}, "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "p": 0.1}, "class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0]]]}, {"name": "dense_5", "config": {"W_constraint": null, "name": "dense_5", "bias": true, "trainable": true, "output_dim": 1, "W_regularizer": null, "init": "zero", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "activation": "linear"}, "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0]]]}], "name": "model_2", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "class_name": "Model"}