{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 140, 200, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block1_conv1", "nb_filter": 64, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block1_conv2", "nb_filter": 64, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block2_conv1", "nb_filter": 128, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block2_conv2", "nb_filter": 128, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block3_conv1", "nb_filter": 256, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block3_conv2", "nb_filter": 256, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block3_conv3", "nb_filter": 256, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block4_conv1", "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block4_conv2", "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block4_conv3", "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block5_conv1", "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block5_conv2", "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "block5_conv3", "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": false, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "bias": true}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": false, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "tf"}, "name": "globalaveragepooling2d_1", "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "elu", "bias": true, "output_dim": 1024}, "name": "dense_1", "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "elu", "bias": true, "output_dim": 512}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}, "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "elu", "bias": true, "output_dim": 128}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "name": "dropout_3", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_4", "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "elu", "bias": true, "output_dim": 32}, "name": "dense_4", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.1}, "name": "dropout_4", "inbound_nodes": [[["dense_4", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_5", "W_constraint": null, "b_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null, "init": "zero", "activity_regularizer": null, "activation": "linear", "bias": true, "output_dim": 1}, "name": "dense_5", "inbound_nodes": [[["dropout_4", 0, 0]]]}], "name": "model_2", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "keras_version": "1.1.2"}