{"config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 140, 200, 3], "input_dtype": "float32"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block1_conv1", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 64, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block1_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block1_conv2", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 64, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block1_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": false, "name": "block1_pool", "pool_size": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block2_conv1", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 128, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block2_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block2_conv2", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 128, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block2_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": false, "name": "block2_pool", "pool_size": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block3_conv1", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 256, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block3_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block3_conv2", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 256, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block3_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block3_conv3", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 256, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block3_conv3", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": false, "name": "block3_pool", "pool_size": [2, 2]}, "name": "block3_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block4_conv1", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block4_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block4_conv2", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block4_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block4_conv3", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block4_conv3", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block4_pool", "pool_size": [2, 2]}, "name": "block4_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block5_conv1", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block5_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block5_conv2", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block5_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "bias": true, "name": "block5_conv3", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_filter": 512, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3}, "name": "block5_conv3", "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block5_pool", "pool_size": [2, 2]}, "name": "block5_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0]]], "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "tf"}, "name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D"}, {"inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "config": {"activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 1024, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_constraint": null}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 512, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_constraint": null}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "p": 0.3, "name": "dropout_2"}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_3", "b_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 128, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_constraint": null}, "name": "dense_3", "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}, "name": "dropout_3", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_4", "b_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 32, "init": "glorot_uniform", "trainable": true, "activation": "elu", "b_constraint": null}, "name": "dense_4", "class_name": "Dense"}, {"inbound_nodes": [[["dense_4", 0, 0]]], "config": {"trainable": true, "p": 0.1, "name": "dropout_4"}, "name": "dropout_4", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_5", "b_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 1, "init": "zero", "trainable": true, "activation": "linear", "b_constraint": null}, "name": "dense_5", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_2", "output_layers": [["dense_5", 0, 0]]}, "keras_version": "1.1.2", "class_name": "Model"}