{"keras_version": "1.1.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 140, 200, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block1_conv1", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block1_conv2", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"trainable": false, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block1_pool"}}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 128, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block2_conv1", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 128, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block2_conv2", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"trainable": false, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block2_pool"}}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 256, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block3_conv1", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 256, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block3_conv2", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "class_name": "Convolution2D", "config": {"trainable": false, "nb_filter": 256, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block3_conv3", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"trainable": false, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block3_pool"}}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 512, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block4_conv1", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 512, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block4_conv2", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 512, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block4_conv3", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block4_pool"}}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 512, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block5_conv1", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 512, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block5_conv2", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 512, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "border_mode": "same", "activation": "relu", "nb_col": 3, "init": "glorot_uniform", "name": "block5_conv3", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "block5_pool"}}, {"inbound_nodes": [[["block5_pool", 0, 0]]], "name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "globalaveragepooling2d_1"}}, {"inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 1024, "name": "dense_1", "activation": "elu", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 512, "name": "dense_2", "activation": "elu", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 128, "name": "dense_3", "activation": "elu", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_4", "class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 32, "name": "dense_4", "activation": "elu", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["dense_4", 0, 0]]], "name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "p": 0.1, "name": "dropout_4"}}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_5", "class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 1, "name": "dense_5", "activation": "linear", "init": "zero", "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_5", 0, 0]], "name": "model_2"}}